single_particle_sedimentation/fluid-openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-0.002 0.0   -0.002)
    (+0.002 0.0   -0.002)
    (+0.002 0.006 -0.002)
    (-0.002 0.006 -0.002)
    (-0.002 0.0   +0.002)
    (+0.002 0.0   +0.002)
    (+0.002 0.006 +0.002)
    (-0.002 0.006 +0.002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (20 30 20)
    simpleGrading (1 1 1)
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);


// ************************************************************************* //
